importModelTutorial/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.00001;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 0.01;
        value           uniform 0.01;
    }
    frontAndBack
    {        
	type            kqRWallFunction;
	value           uniform 0.00001;

    }

    cylinder
    {
        type            kqRWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
